DASimpleFoamMachinePrecision/system/fvSchemes
/*--------------------------------*- C++ -*---------------------------------*\ 
| ========                 |                                                 | 
| \      /  F ield         | OpenFOAM: The Open Source CFD Toolbox           | 
|  \    /   O peration     | Version:  v1812                                 | 
|   \  /    A nd           | Web:      www.OpenFOAM.com                      | 
|    \/     M anipulation  |                                                 | 
\*--------------------------------------------------------------------------*/ 
FoamFile
{
    version     2.0;
    format      ascii;
    class       dictionary;
    object      fvSchemes;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

ddtSchemes 
{
    default                                             steadyState;
}

gradSchemes
{
    default                                             Gauss linear;
}

divSchemes
{
    default                                             none;
    // Can't use bounded scheme. Also, can't use linearUpwind scheme in parallel
    // because the processorFvPatchField is not perfectly AD in parallel yet
    div(phi,U)                                          Gauss upwind;
    div(phi,T)                                          Gauss upwind;
    div(phi,nuTilda)                                    Gauss upwind;
    div(phi,k)                                          Gauss upwind;
    div(phi,omega)                                      Gauss upwind;
    div(phi,epsilon)                                    Gauss upwind;
    div((nuEff*dev2(T(grad(U)))))                       Gauss linear;
    div(pc)                                             Gauss upwind;
}

interpolationSchemes
{
    default                                             linear;
}

laplacianSchemes
{
    default                                             Gauss linear corrected;
}

snGradSchemes
{
    default                                             corrected;
}

wallDist
{
    // Can't use meshWave because the wallDistance update is not AD in parallel
    // meshWaveFrozen computes the wall distance at the begining and will not
    // be updated if the mesh changes 
    method                                              meshWaveFrozen;
}

// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //
